Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
lambda-formatOutput.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-formatOutput/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/179/default/svep/lambda/formatOutput'"
          + "filename_new"   = "builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip"
          + "filename_old"   = "builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-formatOutput"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-formatOutput/builds/e3adea307c1cb6d14a4e4ace040bd380d37cfe405cb7b4874e35bce0cfd61de8.zip" -> (known after apply)
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-06-04T02:17:43.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "COLUMNS"                       = "rank,region,alt,consequence,varName,geneName,geneId,feature,transcriptId,transcriptBiotype,exonNumber,aminoAcids,codons,strand,transcriptSupportLevel,ref,gt,qual,filter,variationId,rsId,omimId,classification,conditions,clinSig,reviewStatus,lastEvaluated,accession,pubmed,afAfr,afEas,afFin,afNfe,afSas,afAmr,af,ac,an,siftMax,af1KG,afKhv,misZ,misOe,misOeCiLower,misOeCiUpper,lofPli,lofOe,lofOeCiUpper,lofOeCiLower" -> "rank,region,alt,consequence,varName,geneName,geneId,feature,transcriptId,transcriptBiotype,exonNumber,aminoAcids,codons,strand,transcriptSupportLevel,ref,gt,qual,filter,variationId,rsId,omimId,classification,conditions,clinSig,reviewStatus,lastEvaluated,accession,pubmed,afAfr,afEas,afFin,afNfe,afSas,afAmr,af,ac,an,siftMax"
                # (6 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "165530849744167340" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/e3adea307c1cb6d14a4e4ace040bd380d37cfe405cb7b4874e35bce0cfd61de8.zip" -> "builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::307946671795:policy/svep-backend-getResultsURL"
        name             = "svep-backend-getResultsURL"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
              - "REGION"                     = "ap-southeast-3"
              - "RESULT_DURATION"            = "86400"
              - "RESULT_SUFFIX"              = "_results.tsv"
              - "SVEP_RESULTS"               = "gaspi-dataportal-20250110044710445000000002"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-initQuery/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/179/default/svep/lambda/initQuery'"
          + "filename_new"   = "builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip"
          + "filename_old"   = "builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-initQuery"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-initQuery.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::307946671795:policy/svep-backend-initQuery"
        name             = "svep-backend-initQuery"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-queryVCF",
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-concatStarter",
                        ]
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-initQuery/builds/bbf6c37606315bbff2d612fd85f7638fc57381ffcfae5f4774fa819a34100a6d.zip" -> (known after apply)
        id                             = "svep-backend-initQuery"
      ~ last_modified                  = "2025-06-04T02:17:49.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CLINIC_JOBS_PROJECT_NAME_INDEX" = "project-name-index" -> null
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "156420438" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/bbf6c37606315bbff2d612fd85f7638fc57381ffcfae5f4774fa819a34100a6d.zip" -> "builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip"
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ last_modified                  = "2025-06-04T02:17:54.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomad"
        name             = "svep-backend-pluginGnomad"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail",
                          ~ "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadOneKG" -> "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomad",
                          ~ "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomad" -> "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-formatOutput",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*"
                    },
                    # (5 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "NEXT_FUNCTION_SNS_TOPIC_ARN"   = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadOneKG" -> "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-formatOutput"
                # (6 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_policy.additional[0] will be destroyed
  # (because aws_iam_policy.additional is not in configuration)
  - resource "aws_iam_policy" "additional" {
      - arn              = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadConstraint" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadConstraint" -> null
      - name             = "svep-backend-pluginGnomadConstraint" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadConstraint",
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-formatOutput",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20241204060930099700000005/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20241204060930099700000005"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUPMYNJ2ZXB73TVCEN" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_policy.logs[0] will be destroyed
  # (because aws_iam_policy.logs is not in configuration)
  - resource "aws_iam_policy" "logs" {
      - arn              = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadConstraint-logs" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadConstraint-logs" -> null
      - name             = "svep-backend-pluginGnomadConstraint-logs" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogGroup"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:*:307946671795:log-group:/aws/lambda/svep-backend-pluginGnomadConstraint:*:*",
                          - "arn:aws:logs:*:307946671795:log-group:/aws/lambda/svep-backend-pluginGnomadConstraint:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUPMYNJ2Z6K7YL2SGS" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_policy_attachment.additional[0] will be destroyed
  # (because aws_iam_policy_attachment.additional is not in configuration)
  - resource "aws_iam_policy_attachment" "additional" {
      - groups     = [] -> null
      - id         = "svep-backend-pluginGnomadConstraint" -> null
      - name       = "svep-backend-pluginGnomadConstraint" -> null
      - policy_arn = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadConstraint" -> null
      - roles      = [
          - "svep-backend-pluginGnomadConstraint",
        ] -> null
      - users      = [] -> null
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_policy_attachment.logs[0] will be destroyed
  # (because aws_iam_policy_attachment.logs is not in configuration)
  - resource "aws_iam_policy_attachment" "logs" {
      - groups     = [] -> null
      - id         = "svep-backend-pluginGnomadConstraint-logs" -> null
      - name       = "svep-backend-pluginGnomadConstraint-logs" -> null
      - policy_arn = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadConstraint-logs" -> null
      - roles      = [
          - "svep-backend-pluginGnomadConstraint",
        ] -> null
      - users      = [] -> null
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::307946671795:role/svep-backend-pluginGnomadConstraint" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-28T00:48:46Z" -> null
      - force_detach_policies = false -> null
      - id                    = "svep-backend-pluginGnomadConstraint" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadConstraint",
          - "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadConstraint-logs",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "svep-backend-pluginGnomadConstraint" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "svep-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "svep-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAUPMYNJ2Z7ECEMG5FS" -> null
        # (3 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.lambda[0] will be destroyed
  # (because aws_lambda_function.lambda is not in configuration)
  - resource "aws_lambda_function" "lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-pluginGnomadConstraint" -> null
      - code_sha256                    = "4qd6ZMBd/WCCMUi1BX/U1uhM1YtlyKjbtwuVuGOmJ7g=" -> null
      - description                    = "Add Gnomad Constraint annotations to sVEP result rows." -> null
      - filename                       = ".terraform/modules/svep.lambda-pluginGnomadConstraint/builds/fa01e559a72abd35a73a2ae40be4f4c86080b1f660e1a8acc42e5d7f21c22026.zip" -> null
      - function_name                  = "svep-backend-pluginGnomadConstraint" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "svep-backend-pluginGnomadConstraint" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-pluginGnomadConstraint/invocations" -> null
      - last_modified                  = "2025-06-04T02:17:38.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> null
      - memory_size                    = 2048 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-pluginGnomadConstraint:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-pluginGnomadConstraint:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::307946671795:role/svep-backend-pluginGnomadConstraint" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_size               = 1499 -> null
      - tags                           = {
          - "Environment" = "dev"
          - "NAME"        = "svep-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all                       = {
          - "Environment" = "dev"
          - "NAME"        = "svep-backend"
          - "Owner"       = "gaspi"
        } -> null
      - timeout                        = 900 -> null
      - version                        = "$LATEST" -> null
        # (5 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendSvepJobEmail"
              - "CONSTRAINT_REFERENCE"          = "gnomad_constraint_metrics.tsv"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "NEXT_FUNCTION_SNS_TOPIC_ARN"   = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-formatOutput"
              - "REFERENCE_LOCATION"            = "svep-backend-references-20241204060930099700000005"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail"
              - "SVEP_TEMP"                     = "svep-backend-temp-20241204060929941500000004"
              - "USER_POOL_ID"                  = "ap-southeast-3_1pggQ2ofX"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/svep-backend-pluginGnomadConstraint" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "1534404695" -> null
      - triggers = {
          - "filename" = "builds/fa01e559a72abd35a73a2ae40be4f4c86080b1f660e1a8acc42e5d7f21c22026.zip"
        } -> null
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_policy.additional[0] will be destroyed
  # (because aws_iam_policy.additional is not in configuration)
  - resource "aws_iam_policy" "additional" {
      - arn              = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadOneKG" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadOneKG" -> null
      - name             = "svep-backend-pluginGnomadOneKG" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadOneKG",
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadConstraint",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20241204060930099700000005/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20241204060930099700000005"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUPMYNJ2ZXRIJW5NQB" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_policy.logs[0] will be destroyed
  # (because aws_iam_policy.logs is not in configuration)
  - resource "aws_iam_policy" "logs" {
      - arn              = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadOneKG-logs" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadOneKG-logs" -> null
      - name             = "svep-backend-pluginGnomadOneKG-logs" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogGroup"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:*:307946671795:log-group:/aws/lambda/svep-backend-pluginGnomadOneKG:*:*",
                          - "arn:aws:logs:*:307946671795:log-group:/aws/lambda/svep-backend-pluginGnomadOneKG:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUPMYNJ2ZSSYJ4OSJA" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_policy_attachment.additional[0] will be destroyed
  # (because aws_iam_policy_attachment.additional is not in configuration)
  - resource "aws_iam_policy_attachment" "additional" {
      - groups     = [] -> null
      - id         = "svep-backend-pluginGnomadOneKG" -> null
      - name       = "svep-backend-pluginGnomadOneKG" -> null
      - policy_arn = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadOneKG" -> null
      - roles      = [
          - "svep-backend-pluginGnomadOneKG",
        ] -> null
      - users      = [] -> null
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_policy_attachment.logs[0] will be destroyed
  # (because aws_iam_policy_attachment.logs is not in configuration)
  - resource "aws_iam_policy_attachment" "logs" {
      - groups     = [] -> null
      - id         = "svep-backend-pluginGnomadOneKG-logs" -> null
      - name       = "svep-backend-pluginGnomadOneKG-logs" -> null
      - policy_arn = "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadOneKG-logs" -> null
      - roles      = [
          - "svep-backend-pluginGnomadOneKG",
        ] -> null
      - users      = [] -> null
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::307946671795:role/svep-backend-pluginGnomadOneKG" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-28T00:48:46Z" -> null
      - force_detach_policies = false -> null
      - id                    = "svep-backend-pluginGnomadOneKG" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadOneKG",
          - "arn:aws:iam::307946671795:policy/svep-backend-pluginGnomadOneKG-logs",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "svep-backend-pluginGnomadOneKG" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "svep-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "svep-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAUPMYNJ2ZZLXTZCLF4" -> null
        # (3 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.lambda[0] will be destroyed
  # (because aws_lambda_function.lambda is not in configuration)
  - resource "aws_lambda_function" "lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-pluginGnomadOneKG" -> null
      - code_sha256                    = "B5OeQUruYIhYBiSI71zJS/jjjz31ujBXW4/mM9QEt6g=" -> null
      - description                    = "Add Gnomad 1kg annotations to sVEP result rows." -> null
      - filename                       = ".terraform/modules/svep.lambda-pluginGnomadOneKG/builds/de4809044c5c06b2cff5d4ba3f5d8569ffe2e9c88b6a2d1c4f78a1444a41e55f.zip" -> null
      - function_name                  = "svep-backend-pluginGnomadOneKG" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "svep-backend-pluginGnomadOneKG" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-pluginGnomadOneKG/invocations" -> null
      - last_modified                  = "2025-06-04T02:17:42.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> null
      - memory_size                    = 2048 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-pluginGnomadOneKG:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-pluginGnomadOneKG:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::307946671795:role/svep-backend-pluginGnomadOneKG" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_size               = 1538 -> null
      - tags                           = {
          - "Environment" = "dev"
          - "NAME"        = "svep-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all                       = {
          - "Environment" = "dev"
          - "NAME"        = "svep-backend"
          - "Owner"       = "gaspi"
        } -> null
      - timeout                        = 900 -> null
      - version                        = "$LATEST" -> null
        # (5 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "NEXT_FUNCTION_SNS_TOPIC_ARN"   = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-pluginGnomadConstraint"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail"
              - "SVEP_TEMP"                     = "svep-backend-temp-20241204060929941500000004"
              - "USER_POOL_ID"                  = "ap-southeast-3_1pggQ2ofX"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/svep-backend-pluginGnomadOneKG" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "3441312700242052096" -> null
      - triggers = {
          - "filename" = "builds/de4809044c5c06b2cff5d4ba3f5d8569ffe2e9c88b6a2d1c4f78a1444a41e55f.zip"
        } -> null
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "svep-backend-qcFigures:svep-backend-qcFigures-0"
        name        = "svep-backend-qcFigures-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20241204060930099700000005/*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:b7655a9c5f6f407c8fca3c944818974ba1099858c5381f27b40dc4ff6b57ceac" -> (known after apply)
      ~ last_modified                  = "2025-06-04T02:30:22.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "FILE_LOCATION"   = "gaspi-dataportal-20250110044710445000000002"
              - "HTS_S3_HOST"     = "s3.ap-southeast-3.amazonaws.com"
              - "RESULT_DURATION" = "86400"
              - "USER_POOL_ID"    = "ap-southeast-3_1pggQ2ofX"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/179/default/svep/lambda/queryVCF'"
          + "filename_new"   = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
          + "filename_old"   = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCF"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::307946671795:policy/svep-backend-queryVCF"
        name             = "svep-backend-queryVCF"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-queryVCFsubmit",
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-queryVCF",
                          - "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-queryGTF",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-queryVCF/builds/72b4322763cd5a81dc2bcd1c08b81310f0079bfccfedaf3c78d527e54352b77f.zip" -> (known after apply)
        id                             = "svep-backend-queryVCF"
      ~ last_modified                  = "2025-06-04T02:17:42.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5053156375651298097" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/72b4322763cd5a81dc2bcd1c08b81310f0079bfccfedaf3c78d527e54352b77f.zip" -> "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-sendJobEmail/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/179/default/svep/lambda/sendJobEmail'"
          + "filename_new"   = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
          + "filename_old"   = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-sendJobEmail"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-sendJobEmail/builds/225ef7dd85825f6b743f92ab563c143c09d1431f9ec5547f58ecf0aa9a43839c.zip" -> (known after apply)
        id                             = "svep-backend-sendJobEmail"
      ~ last_modified                  = "2025-06-04T02:17:47.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5052912209559403686" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/225ef7dd85825f6b743f92ab563c143c09d1431f9ec5547f58ecf0aa9a43839c.zip" -> "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2f079019f27a23ef1e76beac00ad1aa6d6651be48a70ce3d840ce202f0749cb8.zip" -> "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
        id                             = "svep-backend-updateReferenceFiles"
      ~ last_modified                  = "2025-06-04T02:17:01.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GNOMAD_CONSTRAINTS_VERSION"         = "4.1" -> null
                # (8 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "430477293" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2f079019f27a23ef1e76beac00ad1aa6d6651be48a70ce3d840ce202f0749cb8.zip" -> "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
          ~ "timestamp" = "1749003248069168000" -> "1749013405521574000"
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45" -> (known after apply)
      ~ code_sha256                 = "oiwfDS9Aaxywh8JsfHkZbSvKCYwWPCUHGRnvAwsmBM8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-04T02:17:00.621+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:45" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/2b37f2378044c3256624d111f13a526c54ec2c3f9479187e669bfff95b47f25f.zip" -> "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 12725 -> (known after apply)
      ~ version                     = "45" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20241218041518904900000001/builds/2b37f2378044c3256624d111f13a526c54ec2c3f9479187e669bfff95b47f25f.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "b7288609f9c293f717825d11b003b017" -> (known after apply)
      ~ id                            = "builds/2b37f2378044c3256624d111f13a526c54ec2c3f9479187e669bfff95b47f25f.zip" -> (known after apply)
      ~ key                           = "builds/2b37f2378044c3256624d111f13a526c54ec2c3f9479187e669bfff95b47f25f.zip" -> "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/2b37f2378044c3256624d111f13a526c54ec2c3f9479187e669bfff95b47f25f.zip" -> "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2132419803" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2b37f2378044c3256624d111f13a526c54ec2c3f9479187e669bfff95b47f25f.zip" -> "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
          ~ "timestamp" = "1748398937244445000" -> "1749013405176493000"
        }
    }

Plan: 80 to add, 83 to change, 100 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on pgxflow/cloudfront.tf line 45, in resource "aws_cloudfront_distribution" "api_distribution":
│   45:     domain_name = split("/", aws_api_gateway_deployment.PgxApi.invoke_url)[2]
│ 
│ The attribute "invoke_url" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 4 more similar warnings elsewhere)
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: hub01-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "hub01-plan.out"
✅ Terraform plan created successfully: hub01-plan.out
ℹ️  Plan summary:

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:52ed38ce9d8f6074a618be9f13373e61dce0f26be223dcfaad7982c80c17b1cc307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:52ed38ce9d8f6074a618be9f13373e61dce0f26be223dcfaad7982c80c17b1cc" -> null
      - name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      - image_id     = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e" -> null
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for hub01!

Thank you for using Atlantis Schema Deploy
© May, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-hub01
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-hub01
  ```

**Note: Objects have changed outside of Terraform**
Plan: 80 to add, 83 to change, 100 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```